#include <iostream>
#include <cstdlib>


using namespace std;




int main()
{
    setlocale(LC_ALL, "rus");




    // 1-условно "стенки лабиринта"
// 2-"правильный путь, выход из лабиринта"
// 0-"ложный путь"
    int k, i2, j2, l;
    char p;
    int mas[33][20] = { {1,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,}, // инициализация двумерного массива
                        {1,2,1,0,0,1,0,1,2,2,2,1,1,1,1,0,0,0,0,1,},
                        {1,2,1,1,0,1,0,1,2,1,2,2,2,2,1,0,1,1,0,1,},
                        {1,2,2,2,2,2,2,1,2,1,1,1,1,2,1,0,0,1,0,1,},
                        {1,1,1,1,1,1,2,1,2,1,0,0,1,2,1,1,0,1,0,1,},
                        {1,0,0,1,0,0,2,2,2,1,1,0,0,2,0,0,0,1,0,1,},
                        {1,0,1,1,0,1,1,1,1,1,0,0,1,2,1,1,1,1,0,1,},
                        {1,0,0,0,0,0,0,0,0,1,1,1,1,2,1,0,0,0,0,1,},
                        {1,1,1,1,1,1,0,1,1,1,2,2,2,2,1,0,1,1,1,1,},
                        {1,1,0,0,0,1,0,0,1,1,2,1,1,1,1,0,0,0,0,1,},
                        {1,0,0,1,0,0,0,0,0,1,2,2,2,2,1,1,1,1,0,1,},
                        {1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,0,0,0,0,1,},
                        {1,2,2,2,2,2,2,2,2,2,2,2,2,2,1,0,1,1,1,1,},
                        {1,2,1,1,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,},
                        {1,2,1,0,0,0,1,2,2,2,1,0,0,0,0,0,1,1,0,1,},
                        {1,2,1,1,1,1,1,2,1,2,1,1,1,0,1,0,0,0,0,1,},
                        {1,2,1,2,2,2,1,2,1,2,2,2,1,1,1,1,1,1,1,1,},
                        {1,2,1,2,1,2,1,2,1,0,1,2,2,2,2,2,2,2,2,1,},
                        {1,2,1,2,1,2,1,2,1,0,1,1,1,1,1,1,1,1,2,1,},
                        {1,2,1,2,1,2,1,2,1,0,0,0,0,0,0,0,0,0,2,1,},
                        {1,2,1,2,1,2,2,2,1,0,1,1,1,1,1,1,0,1,2,1,},
                        {1,2,1,2,1,1,1,1,1,0,0,0,1,0,1,0,0,1,2,1,},
                        {1,2,1,2,2,1,0,0,1,1,1,0,0,0,1,0,1,1,2,1,},
                        {1,2,1,1,2,1,1,0,0,0,0,0,1,0,1,0,0,1,2,1,},
                        {1,2,1,1,2,1,0,0,1,1,1,1,1,1,1,1,1,1,2,1,},
                        {1,2,1,1,2,1,1,0,1,2,2,2,2,2,2,2,2,2,2,1,},
                        {1,2,1,1,2,1,0,0,1,2,1,1,1,1,1,1,1,1,1,1,},
                        {1,2,1,1,2,1,0,1,1,2,1,1,1,1,1,1,1,1,2,2,},
                        {1,2,1,1,2,1,0,0,1,2,1,1,2,2,2,2,2,2,2,1,},
                        {1,2,1,1,2,1,0,1,1,2,1,1,2,1,1,1,1,1,1,1,},
                        {1,2,1,1,2,1,0,0,1,2,1,1,2,1,0,0,0,1,0,1,},
                        {1,2,2,2,2,1,0,1,1,2,2,2,2,0,0,1,0,0,0,1,},
                        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,} };
    // два цикла - внутренний и внешний, осуществляющие обращение к каждому элементу массива
    k = 0;
    i2 = 0;
    j2 = 1;
    cout << "Чтобы передвигаться используйте следующие кнопки:" << endl;
    cout << "w  -  передвинуться вверх" << endl;
    cout << "a  -  передвинуться влево" << endl;
    cout << "s  -  передвинуться вниз" << endl;
    cout << "d  -  передвинуться вправо" << endl;
    cout << "Затем нажмите Enter." << endl << endl << endl;
    system("pause");
    system("cls");
    while (k == 0)
    {
        for (int i = 0; i < 33; i++) //переключение по строкам
        {
            for (int j = 0; j < 20; j++)// переключение по столбцам
            {
                if ((i < i2 - 1) || (i > i2 + 1) || (j < j2 - 1) || (j > j2 + 1))
                {
                    cout << "   ";
                }
                else
                {
                    if ((i2 == i) && (j2 == j))
                    {
                        cout << " " << static_cast<char>(176) << " ";
                    }
                    else
                    {
                        if (mas[i][j] == 1)
                        {
                            cout << static_cast<char>(182);
                            cout << static_cast<char>(182);
                            cout << static_cast<char>(182);
                        }
                        else
                        {
                            cout << "   ";
                        }
                    }
                }
            }
            cout << endl;
        }
        l = 0;
        while (l == 0)
        {
            cin >> p;
            if ((p == 's') && (mas[i2 + 1][j2] != 1))
            {
                system("cls");
                i2 = i2 + 1;
                break;
            }
            if ((p == 'w') && (mas[i2 - 1][j2] != 1) && (i2 != 0))
            {
                system("cls");
                i2 = i2 - 1;
                break;
            }
            if ((p == 'd') && (mas[i2][j2 + 1] != 1))
            {
                system("cls");
                j2 = j2 + 1;
                break;
            }
            if ((p == 'a') && (mas[i2][j2 - 1] != 1))
            {
                system("cls");
                j2 = j2 - 1;
                break;
            }
            if ((p == 'd') && (i2 == 27) && (j2 == 19))
            {
                system("cls");
                j2 = j2 + 1;
                break;
            }
            if ((p != 'w') && (p != 'a') && (p != 's') && (p != 'd'))
            {
                cout << "Передвигаться можно только с помощью кнопок w,a,s,d..." << endl;
            }
            else
            {
                cout << "Кажется там стена..." << endl;
            }
        }
        system("cls");
        if ((i2 == 27) && (j2 == 20))
        {
            k = 1;
        }
    }
    cout << "Вы выиграли!!!" << endl;
    system("pause");
    return 0;
}
